#+TITLE: wk_systems
#+DESC: Example for the implementation of large IC systems 

** Generate Gemmini

We run make again, but giving a TOP (e.g  =TilePRCIDomain= or =DigitalTop=).
#+begin_src sh
 #make verilog CONFIG=chipyard.GemminiRocketConfig  TOP=DigitalTop > tee GemminiRocketConfig.log
#make verilog CONFIG=chipyard.LeanGemminiRocketConfig  TOP=DigitalTop > tee LeanGemminiRocketConfig.log

make verilog CONFIG=chipyard.GemminiRocketConfig  TOP=DigitalTop   SMEMS_CACHE=sram-cache-nangate45-gemmini.json > tee GemminiRocketConfig.log
#+end_src



List the required memories for =GemminiRocket=
#+begin_src sh :dir /ssh:cadence:~/FORGEJO/wk_systems/do_chipyard/do_mysystems_netlist/ 
cat ./generated-src/chipyard.harness.TestHarness.chipyard.GemminiRocketConfig/chipyard.harness.TestHarness.chipyard.GemminiRocketConfig.top.mems.conf 
#cat ./generated-src/chipyard.harness.TestHarness.chipyard.LeanGemminiRocketConfig/chipyard.harness.TestHarness.chipyard.LeanGemminiRocketConfig.top.mems.conf
#cat ./generated-src/chipyard.harness.TestHarness.chipyard.AgoGemminiRocketConfig/chipyard.harness.TestHarness.chipyard.AgoGemminiRocketConfig.top.mems.conf  
#+end_src

#+RESULTS:
| name | cc_dir_ext                          | depth | 1024 | width | 136 | ports | mrw         | mask_gran | 17 |
| name | cc_banks_0_ext                      | depth | 8192 | width |  64 | ports | rw          |           |    |
| name | rockettile_dcache_data_arrays_0_ext | depth |  256 | width | 512 | ports | mrw         | mask_gran |  8 |
| name | rockettile_dcache_tag_array_ext     | depth |   64 | width | 176 | ports | mrw         | mask_gran | 22 |
| name | mem_ext                             | depth | 4096 | width | 128 | ports | mrw         | mask_gran |  8 |
| name | mem_0_ext                           | depth |  512 | width | 512 | ports | mwrite,read | mask_gran |  8 |
| name | rockettile_icache_tag_array_ext     | depth |   64 | width | 168 | ports | mrw         | mask_gran | 21 |
| name | rockettile_icache_data_arrays_0_ext | depth |  256 | width | 256 | ports | mrw         | mask_gran | 32 |
| name | mem_1_ext                           | depth | 8192 | width |  64 | ports | mrw         | mask_gran |  8 |



#+begin_src python create_sram-cache.py
template_1rwm = """
{{
  "type" : "sram",
  "name" : "{prefix}_{depth}x{width}",
  "depth" : "{depth}",
  "width" : {width},
  "family" : "1RW",
  "vt" : "SRAM",
  "mux" : 1,
  "ports" : [{{
    "address port name" : "addr_in",
    "address port polarity" : "active high",
    "chip enable port name" : "ce_in",
    "chip enable port polarity" : "active high",
    "clock port name" : "clk",
    "clock port polarity" : "positive edge",
    "input port name" : "wd_in",
    "input port polarity" : "active high",
    "mask granularity" : {mask_granularity},
    "mask port name" : "w_mask_in",
    "mask port polarity": "active high",
    "output port name" : "rd_out",
    "output port polarity" : "active high",
    "write enable port name" : "we_in",
    "write enable port polarity" : "active high"
  }}],
  "extra ports" : []
}}
"""
ds = (1024,  8192,  256,  64,  4096,   64,  256,  8192)
ws = ( 136,    64,  512, 176,   128,  168,  256,    64)
ms = (   1,    32,    8,   1,     8,    1,   32,     8)
      
srams_lst = [template_1rwm.format(prefix="fake45", depth=d, width=w, mask_granularity=m) for  d,w,m in zip(ds, ws, ms)]
sram_str = '[' + ', '.join(srams_lst) + ']\n'

with open("sram-cache-nangate45-gemmini.json", "w") as f:
    f.write(sram_str)
    
# Print the line for sram.cfg
template_1rwm_fake = """{{"name": "fakeram45_{depth}x{width}",   "width":  {width},   "depth": {depth},  "banks": 2,  "mask_gran": {mask_granularity}}}"""
srams_fake_lst = [template_1rwm_fake.format(prefix="fake45", depth=d, width=w, mask_granularity=m) for  d,w,m in zip(ds, ws, ms)]
print(',\n'.join(srams_fake_lst))
#+end_src

#+RESULTS:



We can see which are the mems that have been implemented with IPs, except mem_0_ext:
#+begin_src sh :dir /ssh:cadence:~/FORGEJO/wk_systems/do_chipyard/do_mysystems_netlist/  :results raw
egrep "^module|fake"  ./generated-src/chipyard.harness.TestHarness.chipyard.GemminiRocketConfig/gen-collateral/chipyard.harness.TestHarness.chipyard.GemminiRocketConfig.top.mems.v
#+end_src

#+RESULTS:
module cc_dir_ext(
  fake45_1024x136 mem_0_0 (
module cc_banks_0_ext(
  fake45_8192x64 mem_0_0 (
module rockettile_dcache_data_arrays_0_ext(
  fake45_256x512 mem_0_0 (
module rockettile_dcache_tag_array_ext(
  fake45_64x176 mem_0_0 (
module mem_ext(
  fake45_4096x128 mem_0_0 (
module rockettile_icache_tag_array_ext(
  fake45_64x168 mem_0_0 (
module rockettile_icache_data_arrays_0_ext(
  fake45_256x256 mem_0_0 (
module mem_1_ext(
  fake45_8192x64 mem_0_0 (


The problem is that =mem_0_ext= memory has two ports. And therefore, it cannot be automatically generated with the tape-out tools

#+begin_src verilog
  mem_0_ext mem_0_ext ( // @[generators/gemmini/src/main/scala/gemmini/SyncMem.scala:45:24]
    .R0_addr (R0_addr),
    .R0_en   (R0_en),
    .R0_clk  (R0_clk),
    .R0_data (R0_data),
    .W0_addr (W0_addr),
    .W0_en   (W0_en),
    .W0_clk  (W0_clk),
    .W0_data (W0_data),
    .W0_mask (W0_mask)
  );    // @[generators/gemmini/src/main/scala/gemmini/SyncMem.scala:45:24]  
#+end_src


We create some dedicated modules in the directory  =do_synth/IP=


Now we can do the synthesis
#+begin_src tcl :tangle do_synth/cmd/run_GemminiRocket.tcl
set_db init_hdl_search_path  ./rtl/
set_db script_search_path  ./cmd/
set_db source_verbose true
set_db information_level 9
# set_db invs_temp_dir genus_invs
# set_db lp_insert_clock_gating true


# Set Lib
set_db lib_search_path   {/usr/prog/optech/freepdk/fpdk45_v20/NANGATE/NangateOpenCellLibrary_PDKv1_3_v2010_12/Front_End/Liberty/CCS/    /home/agids/usr/agarcia/FORGEJO/wk_systems/do_genram/results/fakeram45_1024x32     /home/agids/usr/agarcia/FORGEJO/wk_systems/do_genram/results/fakeram45_16384x64     /home/agids/usr/agarcia/FORGEJO/wk_systems/do_genram/results/fakeram45_64x32    /home/agids/usr/agarcia/FORGEJO/wk_systems/do_genram/results/fakeram45_8192x64  ./IP }

set_db library {NangateOpenCellLibrary_typical_ccs.lib fakeram45_1024x32.lib   fakeram45_64x32.lib  fakeram45_8192x64.lib fakeram45_16384x64.lib   mem_0_dummy.lib   }

# 
# 

# Set LEF
# read_physical -lef /usr/prog/optech/freepdk/fpdk45_v20/NANGATE/NangateOpenCellLibrary_PDKv1_3_v2010_12/Back_End/lef/NangateOpenCellLibrary.lef
# read_physical -lef /home/agids/usr/agarcia/FORGEJO/wk_systems/do_genram/results/fakeram45_1024x32/fakeram45_1024x32.lef
# read_physical -lef /home/agids/usr/agarcia/FORGEJO/wk_systems/do_genram/results/fakeram45_64x32/fakeram45_64x32.lef

# read parasitic information from QRC tech file
# set_db cap_table_file file
# set_db qrc_tech_file techfile.qrc


read_hdl -sv -f ../do_chipyard/do_mysystems_netlist/generated-src/chipyard.harness.TestHarness.chipyard.GemminiRocketConfig/chipyard.harness.TestHarness.chipyard.GemminiRocketConfig.top.f  ../do_chipyard/do_mysystems_netlist/generated-src/chipyard.harness.TestHarness.chipyard.GemminiRocketConfig/gen-collateral/chipyard.harness.TestHarness.chipyard.GemminiRocketConfig.model.mems.v

elaborate

read_sdc DualRocket.sdc

auto_chipyard_prcictrl_domain_reset_setter_clock_in_member_allClocks_uncore_clock


report_hiearchy
check_design

# Synthesis
syn_generic
syn_map 


# Reports
report_area
report_timing
report_gates

#report clock_gating > reports/compile.clock_gating_$c.rpt

write_hdl > results/DualRocket.v
write_sdc > results/DualRocket.sdc
#write_db TilePRCIDomain -all_root_attributes -to_file TilePRCIDomain.tcl
  
#+end_src




** Example: Dual core Rocket

Generate a dual core
#+begin_src sh
 make verilog CONFIG=chipyard.DualRocketConfig  TOP=DigitalTop   > DualRocketConfig.log
#+end_src


#+begin_src sh
egrep instance_name ./do_chipyard/do_mysystems_netlist/generated-src/chipyard.harness.TestHarness.chipyard.DualRocketConfig/top_module_hierarchy.json  | sed 's/    /*/g' | egrep -v iocell > DualRocketConfig.hierarchy.org  
#+end_src


#+begin_src sh :dir /ssh:cadence:~/FORGEJO/wk_systems/do_chipyard/do_mysystems_netlist/ 
cat ./generated-src/chipyard.harness.TestHarness.chipyard.DualRocketConfig/chipyard.harness.TestHarness.chipyard.DualRocketConfig.top.mems.conf
#+end_src

#+RESULTS:
| name | cc_dir_ext                          | depth |  1024 | width | 144 | ports | mrw | mask_gran | 18 |
| name | cc_banks_0_ext                      | depth | 16384 | width |  64 | ports | rw  |           |    |
| name | rockettile_dcache_data_arrays_0_ext | depth |   512 | width | 512 | ports | mrw | mask_gran |  8 |
| name | rockettile_dcache_tag_array_ext     | depth |    64 | width | 176 | ports | mrw | mask_gran | 22 |
| name | rockettile_icache_tag_array_ext     | depth |    64 | width | 168 | ports | mrw | mask_gran | 21 |
| name | rockettile_icache_data_arrays_0_ext | depth |   512 | width | 256 | ports | mrw | mask_gran | 32 |
| name | mem_ext                             | depth |  8192 | width |  64 | ports | mrw | mask_gran |  8 |

Add the files that define the RTL of DualRocket to the repo as an example
#+begin_src sh
cd /home/agids/usr/agarcia/WORK/chipyard/do_mysystems_netlist/generated-src/chipyard.harness.TestHarness.chipyard.DualRocketConfig/gen-collateral
xargs -a ../chipyard.harness.TestHarness.chipyard.DualRocketConfig.top.f  git add -f
git add -f chipyard.harness.TestHarness.chipyard.DualRocketConfig.top.mems.v
git add -f ../sim_files.f ../sim_files.common.f ../chipyard.harness.TestHarness.chipyard.DualRocketConfig.mems.conf ../chipyard.harness.TestHarness.chipyard.DualRocketConfig.model.f ../chipyard.harness.TestHarness.chipyard.DualRocketConfig.model.mems.conf ../chipyard.harness.TestHarness.chipyard.DualRocketConfig.top.f ../chipyard.harness.TestHarness.chipyard.DualRocketConfig.top.mems.conf
#+end_src




define the timing constraints
#+begin_src tcl :tangle do_synth/cmd/DualRocket.sdc
create_clock [get_ports auto_chipyard_prcictrl_domain_reset_setter_clock_in_member_allClocks_uncore_clock]  -period  8   -waveform {0 4} -name clk

#set_clock_uncertainty 0.025  -setup [get_clocks clk]
#set_clock_uncertainty 0.025  -hold [get_clocks clk]
#set_clock_transition -fall 0.04 [get_clocks clk]
#set_clock_transition -rise 0.04 [get_clocks clk]

#set_dont_touch clock
#set_dont_touch reset

#set_clock_latency -max -source 0.1 [get_clocks clk] 

set_input_delay -max -clock clk  0.25 [filter_collection [all_inputs] { !(is_clock) } ]
set_output_delay -max -clock clk  0.25 [all_outputs]

#+end_src


Read the design and constraints:
#+begin_src tcl :tangle do_synth/cmd/run_DualRocket.tcl
set_db init_hdl_search_path  ./rtl/
set_db script_search_path  ./cmd/
set_db source_verbose true
set_db information_level 9
# set_db invs_temp_dir genus_invs
# set_db lp_insert_clock_gating true


# Set Lib
set_db lib_search_path   {/usr/prog/optech/freepdk/fpdk45_v20/NANGATE/NangateOpenCellLibrary_PDKv1_3_v2010_12/Front_End/Liberty/CCS/    /home/agids/usr/agarcia/FORGEJO/wk_systems/do_genram/results/fakeram45_1024x32     /home/agids/usr/agarcia/FORGEJO/wk_systems/do_genram/results/fakeram45_16384x64     /home/agids/usr/agarcia/FORGEJO/wk_systems/do_genram/results/fakeram45_64x32    /home/agids/usr/agarcia/FORGEJO/wk_systems/do_genram/results/fakeram45_8192x64 }

set_db library {NangateOpenCellLibrary_typical_ccs.lib fakeram45_1024x32.lib   fakeram45_64x32.lib  fakeram45_8192x64.lib fakeram45_16384x64.lib  mem_0_ext.lib  mem_ext.lib }
}

# 
# 

# Set LEF
# read_physical -lef /usr/prog/optech/freepdk/fpdk45_v20/NANGATE/NangateOpenCellLibrary_PDKv1_3_v2010_12/Back_End/lef/NangateOpenCellLibrary.lef
# read_physical -lef /home/agids/usr/agarcia/FORGEJO/wk_systems/do_genram/results/fakeram45_1024x32/fakeram45_1024x32.lef
# read_physical -lef /home/agids/usr/agarcia/FORGEJO/wk_systems/do_genram/results/fakeram45_64x32/fakeram45_64x32.lef

# read parasitic information from QRC tech file
# set_db cap_table_file file
# set_db qrc_tech_file techfile.qrc


read_hdl -sv -f ../do_chipyard/do_mysystems_netlist/generated-src/chipyard.harness.TestHarness.chipyard.DualRocketConfig/chipyard.harness.TestHarness.chipyard.DualRocketConfig.top.f             ../do_chipyard/do_mysystems_netlist/generated-src/chipyard.harness.TestHarness.chipyard.DualRocketConfig/gen-collateral/chipyard.harness.TestHarness.chipyard.DualRocketConfig.top.mems.v

elaborate

read_sdc def.sdc

report_hiearchy
check_design

# Synthesis
syn_generic
syn_map 


# Reports
report_area
report_timing
report_gates

#report clock_gating > reports/compile.clock_gating_$c.rpt

write_hdl > results/DualRocket.v
write_sdc > results/DualRocket.sdc
#write_db TilePRCIDomain -all_root_attributes -to_file TilePRCIDomain.tcl
  
#+end_src


Add the netlist 
#+begin_src sh
git add   do_synth/results/DualRocket.*
#+end_src





#+RESULTS:





